/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Alle datoer]@";
"%@ %[Today]@" = "%1$@ %2$[I dag]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Siden i går]@";
"%@ %[This week]@" = "%1$@ %2$[Denne uken]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[I løpet av de siste 2 ukene]@";
"%@ %[This month]@" = "%1$@ %2$[Denne måneden]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[I løpet av de siste 2 månedene]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Alle]@";
"%@ %[Yes]@" = "%1$@ %2$[Ja]@";
"%@ %[No]@" = "%1$@ %2$[Nei]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Inneholder]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Begynner med]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Slutter med]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[Er]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Nøyaktig]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Før]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[Etter]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Større enn]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Mindre enn]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[I løpet av de]@ %3$@ %4$[siste dagene]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[I løpet av de]@ %3$@ %4$[siste ukene]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[I løpet av de]@ %3$@ %4$[siste månedene]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[I løpet av de]@ %3$@ %4$[siste årene]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Fargerom]@ %2$[Alle fargerom]@";
"%[Color Space]@ %[RGB]@" = "%1$[Fargerom]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Fargerom]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Fargerom]@ %2$[Gråtoner]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Innhold]@ inneholder %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Varighet]@ %2$[Lenger enn]@ %3$@ %4$[min]@ %5$@ %6$[sek]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Varighet]@ %2$[Kortere enn]@ %3$@ %4$[min]@ %5$@ %6$[sek]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Nøkkelord]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Nøkkelord]@ inneholder %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Type]@ er %2$[hvilken som helst]@";
"%[Kind]@ is %[Images]@" = "%1$[Type]@ er %2$[bilder]@";
"%[Kind]@ is %[Text]@" = "%1$[Type]@ er %2$[tekst]@";
"%[Kind]@ is %[PDF]@" = "%1$[Type]@ er %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Type]@ er %2$[filmer]@";
"%[Kind]@ is %[Music]@" = "%1$[Type]@ er %2$[musikk]@";
"%[Kind]@ is %[Documents]@" = "%1$[Type]@ er %2$[dokumenter]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Type]@ er %2$[presentasjoner]@";
"%[Kind]@ is %[Folders]@" = "%1$[Type]@ er %2$[mapper]@";
"%[Kind]@ is %[Applications]@" = "%1$[Type]@ er %2$[programmer]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Type]@ er %2$[annen...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Etikett]@ er %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Sist åpnet]@ %2$[Alle datoer]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Sist endret]@ %2$[Alle datoer]@";
"%[Created]@ %[Any Date]@" = "%1$[Opprettet]@ %2$[Alle datoer]@";
"%[Last Opened]@ %[Today]@" = "%1$[Sist åpnet]@ %2$[I dag]@";
"%[Last Modified]@ %[Today]@" = "%1$[Sist endret]@ %2$[I dag]@";
"%[Created]@ %[Today]@" = "%1$[Opprettet]@ %2$[I dag]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Sist åpnet]@ %2$[Siden i går]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Sist endret]@ %2$[Siden i går]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Opprettet]@ %2$[Siden i går]@";
"%[Last Opened]@ %[This week]@" = "%1$[Sist åpnet]@ %2$[Denne uken]@";
"%[Last Modified]@ %[This week]@" = "%1$[Sist endret]@ %2$[Denne uken]@";
"%[Created]@ %[This week]@" = "%1$[Opprettet]@ %2$[Denne uken]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Sist åpnet]@ %2$[I løpet av de to siste ukene]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Sist endret]@ %2$[I løpet av de to siste ukene]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Opprettet]@ %2$[I løpet av de to siste ukene]@";
"%[Last Opened]@ %[This month]@" = "%1$[Sist åpnet]@ %2$[Denne måneden]@";
"%[Last Modified]@ %[This month]@" = "%1$[Sist endret]@ %2$[Denne måneden]@";
"%[Created]@ %[This month]@" = "%1$[Opprettet]@ %2$[Denne måneden]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Sist åpnet]@ %2$[I løpet av de to siste månedene]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Sist endret]@ %2$[I løpet av de to siste månedene]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Opprettet]@ %2$[I løpet av de to siste månedene]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Sist åpnet]@ %2$[Nøyaktig]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Sist endret]@ %2$[Nøyaktig]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Opprettet]@ %2$[Nøyaktig]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Sist åpnet]@ %2$[Før]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Sist endret]@ %2$[Før]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Opprettet]@ %2$[Før]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Sist åpnet]@ %2$[Etter]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Sist endret]@ %2$[Etter]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Opprettet]@ %2$[Etter]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Sist åpnet]@ %2$[I løpet av de]@ %3$@ %4$[siste dagene]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Sist endret]@ %2$[I løpet av de]@ %3$@ %4$[siste dagene]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Opprettet]@ %2$[I løpet av de]@ %3$@ %4$[siste dagene]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Sist åpnet]@ %2$[I løpet av de]@ %3$@ %4$[siste ukene]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Sist endret]@ %2$[I løpet av de]@ %3$@ %4$[siste ukene]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Opprettet]@ %2$[I løpet av de]@ %3$@ %4$[siste ukene]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Sist åpnet]@ %2$[I løpet av de]@ %3$@ %4$[siste månedene]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Sist endret]@ %2$[I løpet av de]@ %3$@ %4$[siste månedene]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Opprettet]@ %2$[I løpet av de]@ %3$@ %4$[siste månedene]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Sist åpnet]@ %2$[I løpet av de]@ %3$@ %4$[siste årene]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Sist endret]@ %2$[I løpet av de]@ %3$@ %4$[siste årene]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Opprettet]@ %2$[I løpet av de]@ %3$@ %4$[siste årene]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Musikksjanger]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Navneendelse]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Navn]@ %2$[Inneholder]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Navn]@ %2$[Begynner med]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Navn]@ %2$[Slutter med]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Navn]@ %2$[Er]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Retning]@ %2$[Alle retninger]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Retning]@ %2$[Liggende]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Retning]@ %2$[Stående]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Annet...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Rent søk]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Søk etter]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Størrelse]@ %2$[Større enn]@ %3$@ %4$[kB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Størrelse]@ %2$[Mindre enn]@ %3$@ %4$[kB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Størrelse]@ %2$[Større enn]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Størrelse]@ %2$[Mindre enn]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Størrelse]@ %2$[Større enn]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Størrelse]@ %2$[Mindre enn]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Synlighet]@ %2$[Synlig eller usynlig]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Synlighet]@ %2$[Synlige objekter]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Synlighet]@ %2$[Usynlige objekter]@";

